#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tadyjp/home-IoT/runs/run-fm94AkbPG96LUWig

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/soracom_button_to_slack]
aws_kinesis_stream.soracom_button: Refreshing state... [id=arn:aws:kinesis:ap-northeast-1:188529565947:stream/soracom-button]
aws_iam_role.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution]
aws_iam_role_policy_attachment.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution-20220318035103012700000001]
aws_lambda_function.soracom_button_to_slack: Refreshing state... [id=soracom_button_to_slack]
aws_lambda_event_source_mapping.soracom_button_lambda: Refreshing state... [id=ec065c36-7c11-44b2-a922-c35a6664679f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.nature_remo_to_dynamo will be created
  + resource "aws_cloudwatch_log_group" "nature_remo_to_dynamo" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/nature_remo_to_dynamo"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # aws_dynamodb_table.nature_remo_sensor will be created
  + resource "aws_dynamodb_table" "nature_remo_sensor" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "DeviceID"
      + id               = (known after apply)
      + name             = "nature-remo-sensor"
      + range_key        = "Timestamp"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "DeviceID"
          + type = "S"
        }
      + attribute {
          + name = "Timestamp"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_iam_role.nature_remo_to_dynamo will be created
  + resource "aws_iam_role" "nature_remo_to_dynamo" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nature-remo-to-dynamo"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "inline-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:*",
                              + "logs:CreateLogGroup",
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_lambda_function.nature_remo_to_dynamo will be created
  + resource "aws_lambda_function" "nature_remo_to_dynamo" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "archive/nature_remo_to_dynamo.zip"
      + function_name                  = "nature_remo_to_dynamo"
      + handler                        = "nature_remo_to_dynamo.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "n5WAMEtDmI7ASzDbh2KnU8P3nhvRGCi/w6yCHMgHHIE="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.soracom_button_to_slack will be updated in-place
  ~ resource "aws_lambda_function" "soracom_button_to_slack" {
        id                             = "soracom_button_to_slack"
      ~ last_modified                  = "2022-03-18T04:56:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "MQScmffKw/j/BrNUyYPcwdUSSuuggBhOQT/hq5aUw+Y=" -> "n5WAMEtDmI7ASzDbh2KnU8P3nhvRGCi/w6yCHMgHHIE="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.


```
</details>
*Pusher: @tadyjp, Action: `pull_request`*